# Taps
tap 'axllent/apps'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'rg'
brew 'svn' # Needed to install fonts
brew 'thefuck'
brew 'tmux'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'mailpit'
brew 'mysql'
brew 'nginx'
brew 'nvm'
brew 'redis'
brew 'yarn'
brew 'rbenv'
brew 'ruby-build'
brew 'watchman'
brew 'gitmoji'

# Apps
cask 'android-studio'
cask 'browserosaurus'
cask 'caffeine'
cask 'calibre'
cask 'dbngin'
cask 'discord'
cask 'orbstack'
cask 'fig'
cask 'figma'
cask 'firefox'
cask 'flipper'
cask 'flycut'
cask 'google-chrome'
cask 'hyper'
cask 'imageoptim'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'kitty'
cask 'microsoft-teams'
cask 'mouse-fix'
cask 'ngrok'
cask 'notion'
cask 'phpmon'
cask 'postman'
cask 'raycast'
cask 'sequel-ace'
cask 'slack'
cask 'sourcetree'
cask 'tableplus'
cask 'teamviewer'
cask 'telegram'
cask 'the-unarchiver'
cask 'toggl-track'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'
cask 'zulu11' # JDK

# Quicklook
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'SHAREit', id: 1040029915
mas 'Xcode', id: 497799835
