# Taps
tap 'axllent/apps'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'spring-io/tap'
tap 'FelixKratz/formulae' # jankyborders https://github.com/FelixKratz/JankyBorders

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # better cat
brew 'borders' # highlight active window for aerospace
brew 'coreutils' # Those that come with macOS are outdated
brew 'eza' # Better ls
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'grep'
brew 'httpie'
brew 'java'
brew 'jq' # Used for spatie/visit
brew 'kubectx' # Switch k8s context and namespace
brew 'k9s' # Easy k8s
brew 'jesseduffield/lazygit/lazygit'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'nikitabobko/tap/aerospace'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'rg'
brew 'sesh' # session manager for tmux
brew 'spring-boot'
brew 'stern'
brew 'svn' # Needed to install fonts
brew 'thefuck'
brew 'tlrc' # tldr (better man)
brew 'tmux'
brew 'wget'
brew 'yazi'
# brew 'zellij' # terminal multiplixer (better tmux)
brew 'zoxide' # Better cd
brew 'zsh-autosuggestions'
brwe 'zsh-syntax-highlighting'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'jenv'
brew 'mailpit'
brew 'mice'
brew 'watchman'
brew 'gitmoji'
brew 'python-setuptools'

# Apps
cask 'alacritty'
cask 'android-studio'
cask 'arc'
cask 'browserosaurus'
cask 'caffeine'
cask 'calibre'
cask 'codewhisperer'
cask 'discord'
cask 'orbstack'
cask 'figma'
cask 'flycut'
cask 'ghostty'
cask 'herd'
cask 'httpie'
cask 'imageoptim'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'kitty'
cask 'mouse-fix'
cask 'ngrok'
cask 'notion'
cask 'postman'
cask 'raycast'
cask 'slack'
cask 'sourcetree'
cask 'tableplus'
cask 'telegram'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'wezterm'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-lato'
cask 'font-meslo-lg-nerd-font'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'SHAREit', id: 1040029915
mas 'Toggl Track: Hours & Time Log', id: 1291898086
mas 'Xcode', id: 497799835
